Week4_Controllers&Views/SaveUsers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "age", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dylan"], ["email", "dylan@dylan.com"], ["age", 26], ["password", "password"], ["created_at", "2016-11-23 23:04:08.760070"], ["updated_at", "2016-11-23 23:04:08.760070"]]
---
  def create
    # user = User.new(name: params[:name], email: params[:email], password: params[:password], age: params[:age])
    user = User.new( user_params )
    if user.valid?
      user.save